import React, { Component } from 'react';
import axios from 'axios';
export class WholeNews extends Component {
    singleNews = {
        "id": 11,
        "title": "sth sth sth",
        "text": "مدتی پیش بود که در یوتیوب و در میان انبوهی از تریلرها و ویدیوهای گیم پلی بازی های جدید می گشتم تا از بازی های روز خبردار شوم و ببینم عنوان هایی که وقت بازی کردنشان را ندارم چطور عمل کرده اند. ویدیوهای بتل رویال فورتنایت و بلک آپس ۴ کل یوتیوب را گرفته بودند و به جز این ها، دویل می کرای ۵، رزیدنت اویل ۲، Days Gone و The Division 2 اجازه ی نفس کشیدن به هیچ بازی دیگری را نمی دادند. اما نمی دانم از خوش شانسی بود یا چه که چشمم به ۱۵ دقیقه از گیم پلی بازی A Plague Tale: Innocence افتاد. البته اولش نه می خواستم روی ویدیو کلیک کنم و نه اصلاً اسمی از این بازی شنیده بودم، فقط تصویر اولیه را دیدم که دختری جوان دست پسربچه ای را گرفته بود. حتی پیش خودم گفتم «حالا بعد از موفقیت گاد آو وار همه باید یه دور ایده ی پسربچه رو پیاده کنن!»، اما به هر حال نمی دانم چه فعل و انفعالاتی صورت گرفت که نهایتاً روی ویدیو کلیک کردم و ۱۵ دقیقه را بدون توقف نگاه کردم. ویدیو عالی بود و حال و هوا و ایده ی منحصر به فردی داشت که تابحال نظیرش را کمتر دیده بودم. بازی Hellblade Senua’s Sacrifice را در نظر بگیرید که وقتی آمد خیلی ها از وجودش بی اطلاع بودند و بعداً کم کم معروف تر شد و عده ی بیشتری توانستند این شاهکار را تجربه کنند. سعی کنید این اشتباه را در مورد A Plague Tale Innocence انجام ندهید، این بازی یک بازی کامل، قوی و تاثیرگذار است و می توان آن را با بازی های درجه یک مقایسه کرد. پس از Days Gone که واقعاً کمتر از انتظاراتم ظاهر شد و Rage 2 که نظرات پیرامونش خبر از یک بازی متوسط می دهد، اگر A Plague Tale Innocence هم ضعیف ظاهر می شد واقعاً می شد دو ماه اخیر را دو ماه بسیار ناامید کننده در چند سال اخیر نامگذاری کرد. اما خوشبختانه این اتفاق نیفتاد. البته نمی توانم بگویم محصول نهایی سازندگان فرانسوی بازی در استودیوی Asobo Studio یک شاهکار تمام عیار است، اما قطعاً بازی ای است که باید در لیست خرید هر گیمری قرار گیرد و نیز توسط خود گیمرها تبلیغ شود. همچنین باید بگویم در این بازی شاهد یکی از بهترین روابط خواهر برادری در کل بازی ها خواهید بود و اگر کمی در نوشتن مقاله ی چند وقت پیشم که درباره ی بهترین برادران و خواهران تاریخ بازی ها بود تعلیل می کردم، نام آمیسیا (Amicia) و هیوگو (Hugo) قطعاً در بین ۱۰ تا از بهترین روابط خواهر و برادری آورده می شد. با این مقدمه می خواهم به سراغ نقد و بررسی A Plague Tale Innocence بروم تا کمی بیشتر درباره ی بازی با هم گپ بزنیم. با من و گیمفا همراه باشید!",
        "dateAdded": "2019-05-16T19:28:41.943",
        "adminId": 2
    }
    componcomponentdidMount() {
        axios.get(this.link + this.props.match.params.id).then(res => this.arr = res);
    }
    
    render() {
        return (
            <div className="mainPage">
                <section>
                    <div className="FullNews">
                        <img src="img/Vampire-the-Masquerade-Bloodlines.jpg" alt="titleIMG" width="500em" height="250em"></img>
                        <div>
                             <h2>{this.singleNews.title}</h2>
                             <p>{this.singleNews.text}</p>
                        </div>
                    </div>
                </section>
                <nav>
                    <img src="img/login.png" alt width="400em" />
                </nav>
            </div>
            );


    }
}